In [2]:
from azure.storage.blob import BlockBlobService

In [3]:
account_name='storagevsalamand'
account_key='9gwTy19RsFnanUiDnbTDvjPI3F+bk3S8eAuIJD1eA51tiutK/LCaDrsH1jxb4g5/RYSDbnbL/nzJ77XFAfsb1A=='

service_blob = BlockBlobService(account_name, account_key) 
service_blob

In [4]:
container_name = 'jedha'
source_file_path = '/Users/vincentsalamand/Downloads/train (1).csv'
destination_file_path = 'S8-1/train.csv'

service_blob.create_blob_from_path(container_name, destination_file_path, source_file_path)

In [5]:
container_name = 'jedha'
source_file_path = 'S8-1/train.csv'
destination_file_path = 'test_titanic'

service_blob.get_blob_to_path(container_name, source_file_path, destination_file_path)

In [6]:
import pandas as pd

import sqlalchemy

In [16]:
pip install psycopg2

Collecting psycopg2
  Downloading https://files.pythonhosted.org/packages/23/7e/93c325482c328619870b6cd09370f6dbe1148283daca65115cd63642e60f/psycopg2-2.8.2.tar.gz (368kB)
    100% |████████████████████████████████| 368kB 3.8MB/s ta 0:00:011
Building wheels for collected packages: psycopg2
  Building wheel for psycopg2 (setup.py) ... done
  Stored in directory: /Users/vincentsalamand/Library/Caches/pip/wheels/3b/d0/9c/fbbaca1e768e108fdcb88a9a50ea43de141adf842741f8623f
Successfully built psycopg2
Installing collected packages: psycopg2
Successfully installed psycopg2-2.8.2
Note: you may need to restart the kernel to use updated packages.

In [8]:
print("Commande de connexion depuis la console Azure : ")

print("psql --host=serverbddsalamandvincent.postgres.database.azure.com --port=5432 --username=vsalamand@serverbddsalamandvincent --dbname=postgres")

Commande de connexion depuis la console Azure :
psql --host=serverbddsalamandvincent.postgres.database.azure.com --port=5432 --username=vsalamand@serverbddsalamandvincent --dbname=postgres

In [10]:
user = "vsalamand@serverbddsalamandvincent"
pwd = "Azure$$jedha"
server = "serverbddsalamandvincent.postgres.database.azure.com:5432"
database = "dbvs"

connexion_string = "postgresql://{0}:{1}@{2}/{3}".format(user, pwd, server, database)

print("BDD connexion_string : ", connexion_string)

engine = sqlalchemy.create_engine(connexion_string)
engine.connect()

BDD connexion_string :  postgresql://vsalamand@serverbddsalamandvincent:Azure$$jedha@serverbddsalamandvincent.postgres.database.azure.com:5432/dbvs

In [11]:
container_name = 'jedha'
source_file_path = 'S8-1/train.csv'
data = 'train.csv'

service_blob.get_blob_to_path(container_name, source_file_path, data)

dataset = pd.read_csv(data)

In [14]:
dataset.to_sql("table_1", engine, index=False, if_exists="replace")

In [15]:
df_test = pd.read_sql("SELECT * FROM table_1", engine)

In [16]:
df_test.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,None,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,None,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,None,S

In [17]:
dataset.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S